Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/СписаниеВещевогоИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеВещевогоИмущества</name>
  <registerRecords>AccumulationRegister.НоменклатураСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.НоменклатураНаСкладах</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВещевоеИмущество</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>EnumRef.РазмерОдежды</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_пожарной_частью_/src/Documents/СписаниеВещевогоИмущества/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.СписаниеВещевогоИмущества.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеВещевогоИмущества.Дата,
	|	СписаниеВещевогоИмущества.Комментарий,
	|	СписаниеВещевогоИмущества.Номер,
	|	СписаниеВещевогоИмущества.Организация,
	|	СписаниеВещевогоИмущества.Ответственный,
	|	СписаниеВещевогоИмущества.Склад,
	|	СписаниеВещевогоИмущества.ФизическоеЛицо,
	|	СписаниеВещевогоИмущества.ВещевоеИмущество.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Размер,
	|		Количество,
	|		Причина
	|	)
	|ИЗ
	|	Документ.СписаниеВещевогоИмущества КАК СписаниеВещевогоИмущества
	|ГДЕ
	|	СписаниеВещевогоИмущества.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВещевоеИмуществоШапка = Макет.ПолучитьОбласть("ВещевоеИмуществоШапка");
	ОбластьВещевоеИмущество = Макет.ПолучитьОбласть("ВещевоеИмущество");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВещевоеИмуществоШапка);
		ВыборкаВещевоеИмущество = Выборка.ВещевоеИмущество.Выбрать();
		Пока ВыборкаВещевоеИмущество.Следующий() Цикл
			ОбластьВещевоеИмущество.Параметры.Заполнить(ВыборкаВещевоеИмущество);
			ТабДок.Вывести(ОбластьВещевоеИмущество, ВыборкаВещевоеИмущество.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
        ТабДок.Вывести(Подпись);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
